#!/usr/bin/env python
# encoding: utf-8
# -*- coding:utf-8 -*-


"""
@version: 
@author: Herbert
@license: Apache Licence 
@contact: 
@site: 
@software: PyCharm
@file: 类方法实例方法静态方法.py
@time: 2018/9/10 14:31
"""
def bijiao():
    list1 = ['城关区','七里河区','西固区','安宁区','红古区','永登县','皋兰县','榆中县','兰州新区','金川区','永昌县','白银区','平川区','靖远县','会宁县','景泰县','秦州区','麦积区','清水县','秦安县','甘谷县','武山县','张家川回族自治县','凉州区','民勤县','古浪县','天祝藏族自治县','甘州区','肃南裕固族自治县','民乐县','临泽县','高台县','山丹县','崆峒区','泾川县','灵台县','崇信县','庄浪县','静宁县','华亭市','崆峒区','泾川县','灵台县','崇信县','庄浪县','静宁县','华亭市','肃州区','金塔县','瓜州县','肃北蒙古族自治县','阿克塞哈萨克族自治县','玉门市','敦煌市','西峰区','庆城县','环县','华池县','合水县','正宁县','宁县','镇原县','安定区','通渭县','陇西县','渭源县','临洮县','漳县','岷县','武都区','成县','文县','宕昌县','康县','西和县','礼县','徽县','两当县','临夏市','临夏县','康乐县','永靖县','广河县','和政县','东乡族自治县','积石山保安族东乡族撒拉族自治县','合作市','临潭县','卓尼县','舟曲县','迭部县','玛曲县','碌曲县','夏河县']
    list2 = ['城关区','玉门市','瓜州县','敦煌市','高台县','肃州区','金塔县','肃北蒙古族自治县','阿克塞哈萨克族自治县','甘州区','临泽县','肃南裕固族自治县','民勤县','金川区','永昌县','民乐县','古浪县','凉州区','平川区','景泰县','永登县','天祝藏族自治县','庆城县','华池县','环县','白银区','靖远县','七里河区','城关区','西固区','安宁区','皋兰县','红古区','正宁县','合水县','宁县','镇原县','西峰区','崆峒区','静宁县','会宁县','安定区','榆中县','康乐县','临洮县','和政县','广河县','临夏市','东乡族自治县','永靖县','临夏县','积石山保安族东乡族撒拉族自治县','灵台县','崇信县','泾川县','清水县','张家川回族自治县','庄浪县','甘谷县','秦安县','通渭县','武山县','漳县','陇西县','渭源县','临潭县','合作市','夏河县','西和县','礼县','秦州区','麦积区','宕昌县','岷县','迭部县','卓尼县','碌曲县','成县','武都区','舟曲县','康县','文县','山丹县','徽县','两当县','玛曲县']
    c = [x for x in list1 if x not in list2]
    print(c)
def myfunc1(fid):
    if fid > 2550:
        return 1
    else:
        return 0


def mf2(name):
    for county  in['城关区','七里河区','西固区','安宁区','红古区','永登县','皋兰县','榆中县','兰州新区','金川区','永昌县','白银区','平川区','靖远县','会宁县','景泰县','秦州区','麦积区','清水县','秦安县','甘谷县','武山县','张家川回族自治县','凉州区','民勤县','古浪县','天祝藏族自治县','甘州区','肃南裕固族自治县','民乐县','临泽县','高台县','山丹县','崆峒区','泾川县','灵台县','崇信县','庄浪县','静宁县','华亭市','崆峒区','泾川县','灵台县','崇信县','庄浪县','静宁县','华亭市','肃州区','金塔县','瓜州县','肃北蒙古族自治县','阿克塞哈萨克族自治县','玉门市','敦煌市','西峰区','庆城县','环县','华池县','合水县','正宁县','宁县','镇原县','安定区','通渭县','陇西县','渭源县','临洮县','漳县','岷县','武都区','成县','文县','宕昌县','康县','西和县','礼县','徽县','两当县','临夏市','临夏县','康乐县','永靖县','广河县','和政县','东乡族自治县','积石山保安族东乡族撒拉族自治县','合作市','临潭县','卓尼县','舟曲县','迭部县','玛曲县','碌曲县','夏河县']:
        if name == county.decode('utf-8'):
            return 1
    return 0

def myfunc3(name):
    if name in['永登县']:
        return 1
    else:
        return 0

def myfunc4(fid):
    if fid > 2500:
        return 1
    else:
        return 0




class Person:
    grade = 1

    def __init__(self, name):
        self.name = name

    def sayHi(self):  # 加self区别于普通函数
        print('Hello, your name is?', self.name)

    @staticmethod  # 声明静态，去掉则编译报错;还有静态方法不能访问类变量和实例变量
    def sayName():  # 使用了静态方法，则不能再使用self
        print("sayName staticmethod ")  # ,grade,#self.name

    @classmethod  # 类方法
    def classMethod(cls):
        print("class method")


if __name__ == '__main__':
    # p = Person("king")
    # p.sayHi()
    # p.sayName()
    # p.classMethod()
    # Person.classMethod()
    # Person.sayName()
    # print(myfunc4(2600))
    bijiao()